; domain
(define (domain put_task)
 (:requirements :typing :adl)
 (:types
    agent - dummy
    receptacle - dummy
    object -dummy
    receptacle_object - receptacle
    receptacle_object - object
  )

 (:predicates
    (atLocation ?a - agent ?l - receptacle)
    (objectAtLocation ?o - object ?l - receptacle)
    (inReceptacle ?o - object ?r - receptacle)
    (isReceptacleObject ?o - object)
    (holds ?a - agent ?o - object)
    (holdsAny ?a - agent)
    (holdsAnyReceptacleObject ?a - agent)
    (isClean ?o - object)
    (cleanable ?o - object)
    (isHot ?o - object)
    (heatable ?o - object)
    (isCool ?o - object)
    (coolable ?o - object)
    (toggleable ?o - object)
    (isOn ?o - object)
    (isToggled ?o - object)
    (sliceable ?o - object)
    (isSliced ?o - object)
    (isSinkBasin ?r - receptacle)
    (isMicrowave ?r - receptacle)
    (isFridge ?r - receptacle)
    (isKnife ?o - object)
    (isCounterTop ?o - object)
 )

 (:action GotoLocation
    :parameters (?a - agent ?lStart - receptacle ?lEnd - receptacle)
    :precondition (and
            (atLocation ?a ?lStart)
            )
    :effect (and
                (atLocation ?a ?lEnd)
                (not (atLocation ?a ?lStart))
            )
 )



 (:action PickupObjectInReceptacle
    :parameters (?a - agent ?o - object ?r - receptacle)
    :precondition (and
            (atLocation ?a ?r)
            (objectAtLocation ?o ?r)
            (inReceptacle ?o ?r)
            (not (holdsAny ?a))
            )
    :effect (and
                (not (inReceptacle ?o ?r))
                (not (objectAtLocation ?o ?r))
                (holds ?a ?o)
                (holdsAny ?a)
            )
 )

 (:action PickupObjectNoReceptacle
    :parameters (?a - agent ?o - object ?r - receptacle)
    :precondition (and
            (atLocation ?a ?r)
            (objectAtLocation ?o ?r)
            (not (inReceptacle ?o ?r))
            (not (holdsAny ?a))
            )
    :effect (and
                (not (objectAtLocation ?o ?r))
                (holds ?a ?o)
                (holdsAny ?a)
            )
 )

 (:action PutObjectInReceptacle
    :parameters (?a - agent ?o - object ?r - receptacle)
    :precondition (and
            (atLocation ?a ?r)
            (holds ?a ?o)
            (not (holdsAnyReceptacleObject ?a))
            )
    :effect (and
                (inReceptacle ?o ?r)
                (not (holds ?a ?o))
                (not (holdsAny ?a))
                (objectAtLocation ?o ?r)
            )
 )

 (:action PutObjectInReceptacleObject
    :parameters (?a - agent ?o - object ?outerO ?outerR - receptacle)
    :precondition (and
            (atLocation ?a ?outerR)
            (objectAtLocation ?outerO ?outerR)
            (isReceptacleObject ?outerO)
            (not (isReceptacleObject ?o))
            (holds ?a ?o)
            (not (holdsAnyReceptacleObject ?a))
            (inReceptacle ?outerO ?outerR)
            )
    :effect (and
                (inReceptacle ?o ?outerO)
                (inReceptacle ?o ?outerR)
                (not (holds ?a ?o))
                (not (holdsAny ?a))
                (objectAtLocation ?o ?outerR)
            )
 )

 (:action PutReceptacleObjectInReceptacle
    :parameters (?a - agent ?outerO - object ?r - receptacle)
    :precondition (and
            (atLocation ?a ?r)
            (holds ?a ?outerO)
            (holdsAnyReceptacleObject ?a)
            (isReceptacleObject ?outerO)
            )
    :effect (and
                (forall (?obj - object)
                    (when (holds ?a ?obj)
                        (and
                            (not (holds ?a ?obj))
                            (objectAtLocation ?obj ?r)
                            (inReceptacle ?obj ?r)
                        )
                    )
                )
                (not (holdsAny ?a))
                (not (holdsAnyReceptacleObject ?a))
            )
 )

 (:action CleanObject
    :parameters (?a - agent ?o - object ?l - receptacle)
    :precondition (and
            (isSinkBasin ?l)
            (atLocation ?a ?l)
            (holds ?a ?o)
            )
    :effect (and
                (isClean ?o)
            )
 )

 (:action HeatObject
    :parameters (?a - agent ?o - object ?l - receptacle)
    :precondition (and
            (or
                (isMicrowave ?l)
            )
            (atLocation ?a ?l)
            (holds ?a ?o)
            )
    :effect (and
                (isHot ?o)
            )
 )

 (:action CoolObject
    :parameters (?a - agent ?o - object ?l - receptacle)
    :precondition (and
            (or
                (isFridge ?l)
            )
            (atLocation ?a ?l)
            (holds ?a ?o)
            )
    :effect (and
                (isCool ?o)
            )
 )

 (:action ToggleObject
    :parameters (?a - agent ?o - object ?l - receptacle)
    :precondition (and
            (atLocation ?a ?l)
            (objectAtLocation ?o ?l)
            (toggleable ?o)
            )
    :effect (and
                (when (isOn ?o)
                    (not (isOn ?o)))
                (when (not (isOn ?o))
                    (isOn ?o))
                (isToggled ?o)
            )
 )

 (:action SliceObject
    :parameters (?a - agent ?co - object ?ko - object ?l - receptacle)
    :precondition
            (and
                (isKnife ?ko)
                (atLocation ?a ?l)
                (objectAtLocation ?co ?l)
                (sliceable ?co)
                (holds ?a ?ko)
                (isCounterTop ?l)
            )
    :effect (and
                (isSliced ?co)
            )
 )
)

; problem
(define (problem move_Watch1_to_Box2_with_more_object_85)
  (:domain put_task)
  (:objects
    agent1 - agent
    Book2 - object
    Pen2 - object
    Watch1 - object
    Book3 - object
    Laptop1 - object
    Pencil1 - object
    Pen3 - object
    KeyChain1 - object
    CD1 - object
    KeyChain3 - object
    AlarmClock1 - object
    KeyChain2 - object
    Book1 - object
    Pen1 - object
    CreditCard1 - object
    Bed1 - receptacle
    Drawer1 - receptacle
    Box1 - receptacle
    Box2 - receptacle
    Box3 - receptacle
    Desk3 - receptacle
    Drawer4 - receptacle
    Sofa2 - receptacle
    Bed2 - receptacle
    Sofa1 - receptacle
    Desk1 - receptacle
    GarbageCan1 - receptacle
    Drawer3 - receptacle
    Drawer2 - receptacle
    Desk2 - receptacle
    Laptop2 - object
    Laptop3 - object
  )

  (:init
    (atLocation agent1 Bed1)
    (objectAtLocation Watch1 Drawer1)
    (objectAtLocation Book1 Bed1)
    (objectAtLocation CreditCard1 Sofa1)
    (objectAtLocation Pencil1 Drawer2)
    (objectAtLocation Book2 Desk1)
    (objectAtLocation Book3 Drawer3)
    (objectAtLocation Pen2 GarbageCan1)
    (objectAtLocation Pen3 Desk2)
    (objectAtLocation KeyChain1 Sofa2)
    (objectAtLocation KeyChain2 Drawer4)
    (objectAtLocation KeyChain3 Desk3)
    (objectAtLocation Laptop1 Box2)
    (objectAtLocation Laptop2 Box2)
    (objectAtLocation Laptop3 Box1)
  )

  (:goal
    (and
      (objectAtLocation Watch1 Box2)
    )
  )
)

; plan
1. (gotolocation agent1 bed1 drawer1)
   deleted: (atlocation agent1 bed1)
   added: (atlocation agent1 drawer1)
   goals met: 0 of 1
2. (pickupobjectnoreceptacle agent1 watch1 drawer1)
   deleted: (objectatlocation watch1 drawer1)
   added: (holds agent1 watch1) (holdsany agent1)
   goals met: 0 of 1
3. (gotolocation agent1 drawer1 box2)
   deleted: (atlocation agent1 drawer1)
   added: (atlocation agent1 box2)
   goals met: 0 of 1
4. (putobjectinreceptacle agent1 watch1 box2)
   deleted: (holds agent1 watch1) (holdsany agent1)
   added: (inreceptacle watch1 box2) (objectatlocation watch1 box2)
   goals met: 1 of 1
